'''
1. 입력 2. 출력 3. 검색 4. 수정 5. 삭제 6. 종료

선택 : 1
--------- 입력기능 -------

선택 : 2
--------- 출력기능 -------

선택 : 3
--------- 검색기능 -------

선택 : 4
--------- 수정기능 -------

선택 : 5
--------- 삭제기능 -------

선택 : 6
--------- 프로그램 종료 - 굿바이 -------
'''

while True:
    select = int(input("1.입력 2.출력 3.검색 4.수정 5.삭제 6.종료\n선택: "))
    if select == 1:
        print("{:-^50}".format(" 입력기능 "))
    elif select == 2:
        print("{:-^50}".format(" 출력기능 "))
    elif select == 3:
        print("{:-^50}".format(" 검색기능 "))
    elif select == 4:
        print("{:-^50}".format(" 수정기능 "))
    elif select == 5:
        print("{:-^50}".format(" 삭제기능 "))
    elif select == 6:
        print("{:-^50}".format(" 프로그램 종료 - 굿바이 "))
        break
    else:
        print("선택 사항 없습니다.")

